Training summary:
cmdline: model.py --training-dir /opt/data1/data_2_4_2020/ --training-config configs/round2-hyp1.config --output-checkpoint model-round2-hyp1.h5 --output-summary out-round2-hyp1.txt --input-checkpoint model-round1-hyp0.h5 --training-round 2
Training data: /opt/data1/data_2_4_2020/tr_round2/1_forwardx2_driving_log.csv, /opt/data1/data_2_4_2020/tr_round2/1_backwardx3_driving_log.csv, /opt/data1/data_2_4_2020/tr_round2/round2_driving_log.csv
Hyperparameters:
	validation_split=0.2
	batchsize=16
	static_cam_angle_adjust=0.15
	epochs=5
	start_lr=5e-06
	stop_patience=3
	freeze_feature_layers=True
	optimizer=Adam

Total epochs trained: 5
Training loss: 0.009337; Validation loss: 0.009110
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 160, 320, 3)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 160, 320, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 90, 320, 3)   0           lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 43, 158, 24)  1824        cropping2d_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 20, 77, 36)   21636       conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 8, 37, 48)    43248       conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 6, 35, 64)    27712       conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 33, 64)    36928       conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 2, 31, 64)    36928       conv2d_5[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 3968)         0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 1)            0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 3969)         0           flatten_1[0][0]                  
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          794000      concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           12864       dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            65          dense_2[0][0]                    
==================================================================================================
Total params: 975,205
Trainable params: 806,929
Non-trainable params: 168,276
__________________________________________________________________________________________________
