Training summary:
cmdline: model.py --training-files data1/data_2_4_2020/1_backwardx3_driving_log.csv,data1/data_2_4_2020/1_forwardx2_driving_log.csv --training-config hyp1.config --output-summary out-02-05-lr5e-3.txt --output-checkpoint model-lr-5e-3.h5
Hyperparameters:
	%s=%s
	%s=%s
	%s=%s
	%s=%s
	%s=%s
	%s=%s
	%s=%s

Total epochs trained: 19
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 160, 320, 3)       0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 160, 320, 3)       0         
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 90, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 43, 158, 24)       1824      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 20, 77, 36)        21636     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 8, 37, 48)         43248     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 35, 64)         27712     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 33, 64)         36928     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 2, 31, 64)         36928     
_________________________________________________________________
flatten_1 (Flatten)          (None, 3968)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               793800    
_________________________________________________________________
dense_2 (Dense)              (None, 64)                12864     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 65        
=================================================================
Total params: 975,005
Trainable params: 975,005
Non-trainable params: 0
_________________________________________________________________
